import time
import sys

lyrics = [
    ["เธอคือคนที่ฉันตามหา มาแสนนาน", 6],
    ["และเป็นคนที่ฉันใฝ่ฝัน ในหัวใจ", 6],
    ["แม้ชีวิตของฉันตอนนี้ จะเป็นเช่นไร", 6],
    ["แต่อยากให้รับรู้เอาไว้", 7],
    ["อยากบอกว่ารัก รักเธอเหลือเกิน", 7],
    ["แม้วันคืนล่วงเลยพ้นเป็นปี", 5],
    ["แต่คืนนี้ จะบอกเธอนะคนดี", 7],
    ["อยากให้เธอ เชื่อฉันคนนี้ ฉันรักเธอ...", 10]
]

for line in lyrics:
    delay = round(line[1] / len(line[0]), 2)
    for c in line[0]:
        print(c, end="")
        time.sleep(delay)
        sys.stdout.flush()
    print("\n")